def show_start_message() -> None:
    print("Данная программа реализует операции по шифрованию текста")

def text():
    print("Программа работает только на русском языке")

def show_spisok() -> None:
    print("Выберите опцию из списка")
    print("1)Азбука Морзе")
    print("2)Шифр Цезаря")
    print("3)Шифр Атбаша")
    print("4)Завершить работу")

def the_end():
    print("Программа завершила свою работу")
def spisok_error():
    print("Номер введён неккоректно, повторите попытку")